{
    "materia": "Sistemas de comunicaciones",
    "salon": "h-265",
    "color": 1,
    "horarios": [
        {
            "horaInicio": "15:00",
            "horaFin": "18:00",
            "dia": "Lu"
        },
        {
            "horaInicio": "15:30",
            "horaFin": "18:00",
            "dia": "Vi"
        }
    ],
    "temas": [
        {
            "numero": 1,
            "tema": "Fundamentos de los sistemas de comunicaciones",
            "duracion": 3.0,
            "subtemas": [
                "1.1 El sistema de comunicación electrónico o sistema de telecomunicación.\n\t1.1.1 Concepto de comunicación.\n\t1.1.2 Fuente y destino de la información.\n\t1.1.3 Transductores e interfaces de usuario.\n\t1.1.4 Señales analógicas y señales digitales.\n\t1.1.5 Elementos fundamentales de un sistema de comunicación electrónico: transmisor, canal de transmisión y receptor.\n\t1.1.6 Efectos que alteran la información en un sistema de comunicación: distorsión, interferencia y ruido",
                "1.2 Sistemas y servicios modernos de telecomunicaciones.",
                "1.3 El espectro electromagnético y el espectro radioeléctrico",
                "1.4 El enfoque de una arquitectura de comunicación por capas en redes. El modelo de referencia OSI"
            ]
        },
        {
            "numero": 2,
            "tema": "Señales y sistemas en tiempo y frecuencia",
            "duracion": 9.0,
            "subtemas": [
                "2.1 Señales.\n\t2.1.1 Series y transformadas de Fourier. Definiciones y propiedades.\n\t2.1.2 Señales. Tipos de señales, representación de señales en tiempo y frecuencia.\n\t2.1.3 Ruido. Tipos de ruido. Densidad espectral de potencia",
                "2.2 Parámetros y características de los sitemas. Linealidad, respuesta al impulso, función de transferencia, respuesta en frecuencia, ancho de banda.",
                "2.3 Distorsión Lineal y no Lineal.\n\t2.3.1 Transmisión sin distorsión en sistemas lineales.\n\t2.3.2 Distorsión lineal (de amplitud, fase, y grupo) y ecualización.\n\t2.3.3 Sistemas no lineales. Distorsión armónica y de intermodulación",
                "2.4 Ruido, ruido térmico, blanco, gaussiano, coloreado, ancho de banda equivalente de ruido",
                "2.5 Filtros.\n\t2.5.1 Filtros ideales y sus características.\n\t2.5.2 Causalidad, filtros realizables, activos, pasivos.\n\t2.5.3 Filtros Butterworth, Chebyshev, Bessel, Elípticos.\n\t2.5.4 Sistema analógico en banda base. Estructura, relación señal a ruido, repetidores"
            ]
        },
        {
            "numero": 3,
            "tema": "Señalización de banda base digital y de pulsos",
            "duracion": 12.0,
            "subtemas": [
                "3.1 Introducción a los sistemas de comunicación digital.\n\t3.1.1 Ventajas de la transmisión digital. Conversión analógica- digital (A/D): muestreo, cuantización, codificación.\n\t3.1.2 Estructura de un sistema de comunicación digital. Estado actual.",
                "3.2 Muestreo. Teorema de muestreo. Traslape de colas espectrales (aliasing). Muestreo ideal. Muestreo\npráctico: natural e instantáneo (de cresta plana)",
                "3.3 Muestreo ideal. Muestreo práctico: natural e instantáneo (de cresta plana).",
                "3.4 Modulación por amplitud de pulsos (PAM).\r",
                "3.5 Modulación por anchura o duración de pulsos (PDM/PWM) y por posición de pulsos (PPM).",
                "3.6 Modulación por pulsos codificados (PCM).\n\t3.6.1 Muestreo, cuantización y codificación.\n\t3.6.2 Cuantización uniforme y no uniforme. Cuantizadores uniformes, ancho de banda.\n\t3.6.3 Ruido de cuantización, relación señal a ruido en cuantización uniforme.\n\t3.6.4 Cuantización no uniforme. Compansión. Compansión por la ley \"mu\" y por la ley \"A\".\n\t3.6.5 PCM diferencial (DPCM) y PCM diferencial adaptable (ADPCM).\n\t3.6.6 Modulación delta (DM) y modulación delta adaptable (ADM)",
                "3.7 Señalización digital.\n\t3.7.1 Representación vectorial. Estimación de ancho de banda.\n\t3.7.2 Señalización binaria, señalización multinivel.\r",
                "3.8 Transmisión en banda base de señales digitales.\n\t3.8.1 Aspectos fundamentales de un código de línea. Códigos de línea binarios y su espectro de potencia.\n\t3.8.2 Espectro de potencia de las señales multinivel. Eficiencia espectral.\n\t3.8.3 Tasa en bits (bit rate) y tasa en Baud (Baud rate).\n\t3.8.4 Detección de la señal digital en un receptor. Efectos del ruido. Probabilidad de bits en error. Tasa de bits en error (BER).\n\t3.8.5 El repetidor regenerativo. Recuperación del reloj a partir de la señal digital recibida.\r",
                "3.9 Interferencia entre símbolos (ISI) y conformado de pulsos.\n\t3.9.1 Primer método o criterio de Nyquist. Técnica del coseno alzado.\n\t3.9.2 Segundo y Tercer método de Nyquist para control de ISI.\n\t3.9.3 Patrón de ojo y su interpretación",
                "3.10 Multiplexión por división de tiempo (TDM).\n\t3.10.1 Esquema básico de una multiplexión en tiempo. Sincronización de trama.\n\t3.10.2 Jerarquía Digital Plesiócrona (PDH) y Síncrona (SDH). Jerarquías TDM: europea y norteamericana.\n\t3.10.3 TDM estadístico.\n\t3.10.4 Acceso múltiple por división de tiempo (TDMA).\r"
            ]
        },
        {
            "numero": 4,
            "tema": "Sistemas pasabanda analógicos y digitales ",
            "duracion": 12.0,
            "subtemas": [
                "4.1 Modulación digital y analógica. Señales y sistemas pasabanda.\n\t4.1.1 Teorema de modulación. Representación con envolvente compleja.\n\t4.1.2 Teorema de muestreo para señales pasabanda",
                "4.2 Modulación lineal y angular.\n\t4.2.1 Doble banda lateral con y sin portadora (AM, DSB-SC).\n\t4.2.2 Banda lateral única, residual e independiente (SSB, VSB e ISB).\n\t4.2.3 Detección coherente y detección de envolvente.\n\t4.2.4 Modulación angular: en fase (PM) y en frecuencia (FM).\n\t4.2.5 Modulación angular de banda angosta y de banda ancha.\n\t4.2.6 Pre-énfasis y de-énfasis de señales de audio moduladoras en FM.\n\t4.2.7 Ruido y efecto de umbral en FM.",
                "4.3 Conversión de frecuencia. Receptor superheterodino.\n\t4.3.1 Multiplexión por División de Frecuencia (FDM).",
                "4.4 Técnicas de modulación de señalización pasabanda digital binaria.\n\t4.4.1 De amplitud (ASK, OOK).\n\t4.4.2 De fase (PSK, PRK, BPSK, DPSK).\n\t4.4.3 De frecuencia (FSK, BFSK)",
                "4.5 Técnicas de modulación de señalización pasabanda multinivel.\n\t4.5.1 Técnicas M-arias (MASK, MFSK, MPSK) y eficiencia espectral.\n\t4.5.2 Técnicas de cuadratura (QPSK, QAM), ampltud-fase (APK).\n\t4.5.3 Modulación por desplazamiento mínimo (MSK, GMSK).",
                "4.6 Sistemas de espectro expandido.\n\t4.6.1 Secuencia directa, salto de frecuencia, salto de tiempos.\n\t4.6.2 Secuencias de Walsh, código Gold. Acceso Múltiple por división de código (CDMA). Receptor RAKE.",
                "4.7 Multiplexión por división de frecuencia ortogonal (OFDM).\r"
            ]
        },
        {
            "numero": 5,
            "tema": "Medios de transmisión",
            "duracion": 6.0,
            "subtemas": [
                "5.1 Ondas radioeléctricas.\n\t5.1.1 Propagación en el espacio libre.\n\t5.1.2 Reflexión, refracción, esparcimiento y difracción.\n\t5.1.3 Modos de propagación de las ondas radioeléctricas: onda de superficie, onda de espacio, onda reflejada, onda ionosférica, onda esparcida en la troposfera, onda esparcida en micro-meteoritos.",
                "5.2 Líneas de dos conductores.\n\t5.2.1 Parámetros concentrados y distribuidos.\n\t5.2.2 Parámetros imagen: impedancia característica, atenuación, desfasamiento, retardo.\n\t5.2.3 Características de propagación en función de la frecuencia. Pérdidas, acoplamiento.\n\t5.2.4 Parámetros comerciales de cable coaxial y UTP.",
                "5.3 Fibras ópticas.\n\t5.3.1 Características de las fibras ópticas, emisores y detectores ópticos. Empalmes y conectores.\n\t5.3.2 Acopladores y conmutadores ópticos. Cables de fibra óptica. Capacidad y pérdidas."
            ]
        },
        {
            "numero": 6,
            "tema": "Sistemas de comunicaciones",
            "duracion": 6.0,
            "subtemas": [
                "6.1 Red telefónica pública. Arquitectura básica, señalizaciones. ISDN.",
                "6.2 Línea de abonado digital (xDSL).",
                "6.3 Sistemas de telefonía celular. 1G, 2G, 3G y 4G.",
                "6.4 Redes inalámbricas de datos. Wi-Fi, Wi-Max.\r",
                "6.5 Comunicaciones por satélite. Órbitas, tipos de satélites. La órbita geoestacionaria",
                "6.6 Radiodifusión digital (sonora y televisión).",
                "6.7 Redes de servicios integrados de cableros."
            ]
        }
    ]
}